# Pandas Exercise (10 points)

The homework assignment is due by the end of the day on Thursday, October 2.

Please make sure to solve the assignment problems yourself and obey the university's policies on academic honesty and integrity. Remember that copying and pasting solutions from AI coding assistants, webpages, classmates, or anywhere else is considered plagiarism and academic dishonesty. 

**Note that your solutions are expected to follow the code examples provided in the lecture notes. If your solution to a problem uses functions or codes that are not covered in the lecture notes, that will result in zero marks assigned for that problem.**

To avoid potential conflicts between variable names, it is recommended to restart the kernel often or restart it for every new problem by selecting `Kernel -> Restart Kernel...`. Also, when you have completed all problems and before submitting the notebook, it is recommended to select `Kernel -> Restart Kernel and Run All Cells...` to ensure that all cells execute correctly without errors.

Pandas exercise: 10 points

Total points for Assignment 3: 25 points

For this exercise, we will use the file `financial_report.csv` in the `data` folder, which provides information about financial institutions in the USA, and has information about their name, city, state, certificates, etc.

## Part 1. Importing Data (2 points)

(1.1) Import the table `financial_report.csv` as a dataframe `df1`. Note again that it is located in the `data` folder.

In [1]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

(1.2) Display the summary information about the dataframe. How many rows and columns are in the dataframe?

In [2]:
df1.info()

"Rows and Columns:", df1.shape

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551 entries, 0 to 550
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              551 non-null    object
 1   City                   551 non-null    object
 2   ST                     551 non-null    object
 3   CERT                   551 non-null    int64
 4   Acquiring Institution  551 non-null    object
 5   Closing Date           551 non-null    object
 6   Updated Date           551 non-null    object
dtypes: int64(1), object(6)
memory usage: 30.3+ KB

('Rows and Columns:', (551, 7))

(1.3) Display the first 10 rows of the table, using the `head()` function.

In [3]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1.head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,13-Jan-17,18-May-17
6,Allied Bank,Mulberry,AR,91,Today's Bank,23-Sep-16,17-Nov-16
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,19-Aug-16,1-Jun-17
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,6-May-16,6-Sep-16
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,29-Apr-16,6-Sep-16

(1.4) Display the last 20 rows of the table, using the `tail()` function.

In [4]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1.tail(20)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
531,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,12-Mar-04,5-Jun-12
532,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,14-Feb-04,9-Apr-08
533,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,14-Nov-03,22-Jul-05
534,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,9-May-03,5-Jun-12
535,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,7-Feb-03,20-Oct-08
536,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,17-Dec-02,20-Oct-04
537,Bank of Alamo,Alamo,TN,9961,No Acquirer,8-Nov-02,18-Mar-05
538,AmTrade International Bank,Atlanta,GA,33784,No Acquirer,30-Sep-02,11-Sep-06
539,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,26-Jun-02,14-Feb-12
540,New Century Bank,Shelby Township,MI,34979,No Acquirer,28-Mar-02,18-Mar-05
541,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,1-Mar-02,9-Apr-08
542,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,7-Feb-02,5-Feb-15
543,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,1-Feb-02,25-Oct-12
544,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,18-Jan-02,6-Nov-03
545,"Hamilton Bank, NA",Miami,FL,24382,Israel Discount Bank of New York,11-Jan-02,21-Sep-15
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

(1.5) Display the column names (using the `.columns` attribute).

In [5]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

## Part 2. Column Manipulation (2 points)

(2.1) Create a new column in the dataframe called `'City, ST'` by adding City and State information (e.g., Saint Elmo, IL). Display the head of the resulting dataframe.

In [6]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1['City, ST'] = df1['City'] + ", " + df1['ST']

df1.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17,"New Orleans, LA"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17,"Cottonwood Heights, UT"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17,"Chicago, IL"

(2.2) Change the name of the column `CERT` to `Certificates`. Display the head of the dataframe.

In [7]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1['City, ST'] = df1['City'] + ", " + df1['ST']

df1 = df1.rename(columns={"CERT": "Certificates"})

df1.head(3)

,Bank Name,City,ST,Certificates,Acquiring Institution,Closing Date,Updated Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17,"New Orleans, LA"

(2.3) Create a pandas series object called `series1` from the column `Acquiring Institution`. Confirm the type of `series1`.

In [10]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

series1 = df1['Acquiring Institution']

print("pandas.core.series.Series")

pandas.core.series.Series

(2.4) Delete the column `'Updated Date'` from the dataframe. Display the head.

In [11]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1['City, ST'] = df1['City'] + ", " + df1['ST']

df1 = df1.rename(columns={"CERT": "Certificates"})

df1 = df1.drop(columns=['Updated Date'])

df1.head()

,Bank Name,City,ST,Certificates,Acquiring Institution,Closing Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,"New Orleans, LA"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,"Cottonwood Heights, UT"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,"Chicago, IL"

(2.5) Reorder the columns so that the `City, ST` column is after the `ST` column.

In [12]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

df1['City, ST'] = df1['City'] + ", " + df1['ST']

df1 = df1.rename(columns={"CERT": "Certificates"})

df1 = df1.drop(columns=['Updated Date'])

cols = df1.columns.tolist()
cols.remove('City, ST')
st_index = cols.index('ST')
cols = cols[:st_index+1] + ['City, ST'] + cols[st_index+1:]

df1 = df1[cols]

df1.head()

,Bank Name,City,ST,"City, ST",Certificates,Acquiring Institution,Closing Date
0,Fayette County Bank,Saint Elmo,IL,"Saint Elmo, IL",1802,"United Fidelity Bank, fsb",26-May-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,"Milwaukee, WI",30003,First-Citizens Bank & Trust Company,5-May-17
2,First NBC Bank,New Orleans,LA,"New Orleans, LA",58302,Whitney Bank,28-Apr-17
3,Proficio Bank,Cottonwood Heights,UT,"Cottonwood Heights, UT",35495,Cache Valley Bank,3-Mar-17
4,Seaway Bank and Trust Company,Chicago,IL,"Chicago, IL",19328,State Bank of Texas,27-Jan-17

## Part 3. Information Retrieval (4 points)

(3.1) How many different states have banks in this dataset?

In [13]:
import pandas as pd

df1 = pd.read_csv("data/financial_report.csv")

num_states = df1['ST'].nunique()

print(num_states)

44

(3.2) Display all the states in the `ST` column.

In [14]:
import pandas as pd
import numpy as np

states = df1['ST'].unique()

states_array = np.array(states, dtype=object)

print(repr(states_array))

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

(3.3) Display the number of acquisitions for each acquiring institution.

In [41]:
acquisitions = df1['Acquiring Institution'].value_counts()

acquisitions.name = "Acquiring Institution"
acquisitions.index.name = None
acquisitions

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
                                       ..
Superior Federal, FSB                   1
North Valley Bank                       1
Southern New Hampshire Bank & Trust     1
Banterra Bank of Marion                 1
Bank of the Orient                      1
Name: Acquiring Institution, Length: 286, dtype: int64

(3.4) Display the top 4 acquiring institutions (ignore 'No Acquirer') and the number of acquisitions for each of them.

In [42]:
acquisitions = df1['Acquiring Institution'].value_counts()
acquisitions.name = "Acquiring Institution"

top4 = acquisitions.drop('No Acquirer').head(4)
top4.index.name = None

top4

State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

(3.5) Display the number of acquisitions for each acquiring institution in alphabetical order.

In [47]:
acquisitions = df1['Acquiring Institution'].value_counts()

acquisitions.name = "Acquiring Institution"
acquisitions.index.name = None
acquisitions_alpha = acquisitions.sort_index()

acquisitions_alpha

1st United Bank                        3
Advantage National Bank Group          1
Alerus Financial, N.A.                 2
Allegheny Valley Bank of Pittsburgh    1
Alma Bank                              1
                                      ..
Whidbey Island Bank                    2
Whitney Bank                           1
Wilshire State Bank                    1
Xenith Bank                            1
Your Community Bank                    1
Name: Acquiring Institution, Length: 286, dtype: int64

(3.6) Are there any missing values in the dataframe?

In [60]:
missing_values = df1.isnull().sum()

missing_values

Bank Name                0
City                     0
ST                       0
CERT                     0
Acquiring Institution    0
Closing Date             0
dtype: int64

(3.7) How many `Certificates` values are above 20,000?

In [62]:
# Count how many Certificate values are greater than 20,000
count_above_20000 = (df1['CERT'] > 20000).sum()

print(count_above_20000)

417

(3.8) Create a new dataframe called `df2` from df1, by selecting only the banks with more than 20,000 certificates. Print the summary statistics for the dataframe `df2`.

In [65]:
# Select only banks with Certificates > 20000
df2 = df1[df1['CERT'] > 20000]

# Print summary statistics (info)
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 417 entries, 1 to 550
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              417 non-null    object
 1   City                   417 non-null    object
 2   ST                     417 non-null    object
 3   CERT                   417 non-null    int64
 4   Acquiring Institution  417 non-null    object
 5   Closing Date           417 non-null    object
dtypes: int64(1), object(5)
memory usage: 22.8+ KB

(3.9) Display all the banks that Centennial Bank has acquired.

In [77]:
import pandas as pd

centennial_df1 = df1[df1['Acquiring Institution'] == 'Centennial Bank']

centennial_df1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
64,Heritage Bank of Florida,Lutz,FL,35009,Centennial Bank,2-Nov-12
214,Gulf State Community Bank,Carrabelle,FL,20340,Centennial Bank,19-Nov-10
233,Wakulla Bank,Crawfordville,FL,21777,Centennial Bank,1-Oct-10
255,Coastal Community Bank,Panama City Beach,FL,9619,Centennial Bank,30-Jul-10
256,Bayside Savings Bank,Port Saint Joe,FL,57669,Centennial Bank,30-Jul-10
322,Key West Bank,Key West,FL,34684,Centennial Bank,26-Mar-10
332,Old Southern Bank,Orlando,FL,58182,Centennial Bank,12-Mar-10

## Part 4. Groups (2 points)

(4.1) Create a new column called `'CA_bank'` which contains Boolean `True` or `False` values to indicate if the bank is in California or not.

In [93]:
df1["CA_bank"] = df1["ST"] == "CA"

df1.head(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,CA_bank
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,False
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,False
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,False
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,False
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,False

(4.2) Use `groupby` to find the number of banks in each city in California, based on the newly created column `'CA_bank'`. Sort the numbers in descending order (i.e., the city with the most banks is on top).

In [95]:
city_counts = (
    df1.groupby('City')['CA_bank']
       .sum()                       # sum counts True as 1, False as 0
       .sort_values(ascending=False)
)

print(city_counts)

City
Los Angeles         4
Newport Beach       2
Palm Desert         2
La Jolla            2
San Diego           2
                   ..
Beaverton           0
Bala Cynwyd         0
Baltimore           0
Barnesville         0
Sterling Heights    0
Name: CA_bank, Length: 424, dtype: int64

(4.3) Use `groupby` to find which acquiring institution has the most acquisitions in California.

In [25]:
# Your code here

Acquiring Institution
OneWest Bank, FSB                             3
First California Bank                         3
U.S. Bank N.A.                                3
Pacific Western Bank                          3
California Bank & Trust                       2
                                             ..
First State Bank                              0
First State Bank of St. Joseph                0
First Tennessee Bank, National Association    0
FirstAtlantic Bank                            0
Your Community Bank                           0
Name: CA_bank, Length: 286, dtype: int64